Revit 2027 API
BuiltInFailures.DimensionFailures.AssocpropNeedJog Property
 Need to add jog in order to satisfy constraints
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssocpropNeedJog { get; }
Public Shared ReadOnly Property AssocpropNeedJog As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssocpropNeedJog {
	FailureDefinitionId^ get ();
}
static member AssocpropNeedJog : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace